УТ_для_edt/src/ExchangePlans/CRM_СинхронизацияСМобильнымПриложениемНовый/CRM_СинхронизацияСМобильнымПриложениемНовый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="df0549ff-2ca6-4f11-ab58-449d09e1906e">
  <name>CRM_СинхронизацияСМобильнымПриложениемНовый</name>
  <comment>Не затягивать из CRM3!</comment>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеПользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

УТ_для_edt/src/InformationRegisters/ПравилаДляОбменаДанными/ПравилаДляОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПравилаДляОбменаДанными</name>
  <resources>
    <name>ИмяМакетаПравил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяМакетаПравилКорреспондента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПланаОбменаИзПравил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаОбработкиДляОтладкиВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаОбработкиДляОтладкиЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаПравил</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаПротоколаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнформацияОПравилах</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникПравил</name>
    <type>
      <types>EnumRef.ИсточникиПравилДляОбменаДанными</types>
    </type>
  </resources>
  <resources>
    <name>НеОстанавливатьПоОшибке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПравилаXML</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПравилаXMLКорреспондента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПравилаЗачитанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПравилаЗачитанныеКорреспондента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>РежимОтладки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимОтладкиВыгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимОтладкиЗагрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РежимПротоколированияОбменаДанными</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ИспользоватьФильтрВыборочнойРегистрацииОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаЗагружены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИмяПланаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПравил</name>
    <type>
      <types>EnumRef.ВидыПравилДляОбменаДанными</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/ExchangePlans/CRM_СинхронизацияСМобильнымПриложениемНовый/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если РаботаВМоделиСервиса.РазделениеВключено() Тогда Возврат КонецЕсли;
	Если НЕ Константы.CRM_ИспользуетсяОбменСiCRM.Получить() Или ЭтотУзел Тогда Возврат КонецЕсли;
	МассивДоступныеПользователи = CRM_СинхронизацияСiCRMНовый.ПолучитьСписокДоступныхПользователейДляОбмена(Пользователь);
	ДоступныеПользователи.Очистить();
	Для Каждого ДоступныйПользователь Из МассивДоступныеПользователи Цикл
		Если НЕ ДоступныйПользователь.ПометкаУдаления Тогда
			Стр = ДоступныеПользователи.Добавить();
			Стр.Пользователь = ДоступныйПользователь;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если РаботаВМоделиСервиса.РазделениеВключено() Тогда Возврат КонецЕсли;
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("ИмяПланаОбмена",  "CRM_СинхронизацияСМобильнымПриложениемНовый");
	СтруктураЗаписи.Вставить("ВидПравил",       Перечисления.ВидыПравилДляОбменаДанными.ПравилаРегистрацииОбъектов);
	СтруктураЗаписи.Вставить("ИмяМакетаПравил", "ПравилаРегистрации");
	СтруктураЗаписи.Вставить("ИсточникПравил",  Перечисления.ИсточникиПравилДляОбменаДанными.МакетКонфигурации);
	СтруктураЗаписи.Вставить("ИспользоватьФильтрВыборочнойРегистрацииОбъектов", Истина);
	
	// Получаем набор записей регистра.
	
	НаборЗаписей = СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, "ПравилаДляОбменаДанными");
	
	// Добавляем только одну запись в новый набор записей.
	НоваяЗапись = НаборЗаписей.Добавить();
	
	// Заполняем значения свойств записи из структуры.
	ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
	
	// Загружаем правила для обмена данными в ИБ.
	РегистрыСведений.ПравилаДляОбменаДанными.ЗагрузитьПравила(Отказ, НаборЗаписей[0]);
	
	Если Не Отказ Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра)
	
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
	
	// Создаем набор записей регистра.
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	// Устанавливаем отбор по измерениям регистра.
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		// Если задано значение в структуре, то отбор устанавливаем.
		Если СтруктураЗаписи.Свойство(Измерение.Имя) Тогда
			
			НаборЗаписей.Отбор[Измерение.Имя].Установить(СтруктураЗаписи[Измерение.Имя]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НаборЗаписей;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли
